#算术运算符：+ - / *   //   %   **
print("10 + 4 =",10 + 4)
print("10 - 4 =",10 - 4)
print("10 * 4 =",10 * 4)
print("10 / 4 =",10 / 4)
print("10 // 4 =",10 // 4) #整除（结果为整数）
print("10 % 4 =",10 % 4)  #取余/求模
print("10 ** 4 =",10 ** 4) # 10的4次方，幂指数

#算术运算符的优先级---> ** -->*    /  //    %  -->+ -
print("0.1 + 10 / 4 ** 3 =", 0.1 + 10 / 4 ** 3)

#案例1:要求输入两个数x与y，分别输出x+y和x-y的结果
#float(..)--->将其他类型转为浮点数类型
x = float(input("输入x的数:"))
y = float(input("输入y的数:"))
print("x + y=",x + y)
print("x - y=", x - y)


####赋值运算符#####
num = 85
num += 10 # num =num + 10
print("num += 10 后，num = ", num)

num -= 10 # num =num - 10
print("num -= 10 后，num = ", num)  

num *= 10 # num =num * 10
print("num *= 10 后，num = ", num)  

num /= 10 # num =num / 10
print("num /= 10 后，num = ", num)

num //= 10 # num =num // 10
print("num //= 10 后，num = ", num)

num %= 3 # num =num % 3
print("num %= 3 后，num = ", num)

num **= 3 # num =num ** 3
print("num **= 3 后，num = ", num)


#########比较运算符： ==  ！=   >   <   >=  <=
print("100 == 100吗 :",100 == 100)
print("'100' == '100'吗：","100" == "100")
print("100 != 100吗:", 100 != 100)

print("100 < 100吗:", 100 < 100)
print("100 <= 100吗:",100 <= 100)

print("100 > 100吗:", 100 > 100)
print("100 >= 100吗:", 100 >= 100)

#判断偶数用num %2 == 0


#########逻辑运算符：and  or  not##########
#案例1：要求输入一个整数，判断这个数是否在10到20之间---->在：True  不在：False
num = int(input("请输入一个整数:"))#input表示输入的内容为字符串类型，int(..)将字符串转为整数类型
print(f"{num}是否在10到20之间:",num >= 10 and num <= 20) #and连接的条件是并且的关系，两个条件 
print(f"{num}是否在10到20之间:",10 <= num <= 20) #python中可以直接写成这样，简易比较


#案例2:：要求输入一个整数，判断这个数是否不在10到20之间
n = int(input("请输入一个整数:"))
print(f"{n}是否不在10到20之间:",n < 10 or n > 20) #or连接的条件是或者的关系，两个条件只要有一个成立就为True ,结果为True；全部不成立才为False



#逻辑运算符运用场景：B站登入方式
#逻辑运算符用于连接多个布尔表达式（True/False），最终结果为True或False
#and（并且，同时成立）
#or（或者，至少有一个成立）
#not（非，取反）
